{
  "bias": "",
  "nonresponse-bias": "",
  "stacking": "",
  "bagging": "Is also called bootstrap aggregation. It is a technique for reducing variances for estimated prediction functions and does so by averaging a number of noisy but approximately unbiased models.",
  "spinning": "Based on the same idea as bagging and is also called feature bagging or random subspace learning.",
  "inductive-bias": "The preference for one distinction over another. If the inductive bias is too far away from the concept that is being learned, the whole learning might fail.",
  "cross-validation": "Is sometimes called rotation estimation which by itself describes the behaviour very well. For example, if you break up your training data into 10 equally big partitions, you use the learning alogorithm on 9 of them and test on the remaining partition for 10 cycles. Thus, every partition will be the training set once. One disadvantage is that it is computationally expensive.",
  "normalization": "Is a good way of keeping the data consistent. There are two basic types of normalization: example and feature normalization.",
  "feature-normalization": "Go through every feature and apply the same adjustment across all examples. There are two standard techniques to use: centering and scaling. Centering to keep the data set close around the origin. Scaling to make sure each feature has variance 1 across the training data.",
  "example-normalization": "Go through every feature but adjust them individually. The standard technique is to make sure that each feature vector has the length of one. The advantages of example normalization is that comparisons between data sets are more straightforward.",
  "approximation-error": "Will measure how well the model family is performing.",
  "estimation-error": "Will measure how far off one classifer is from the optimal classifier of that type.",
  "bias-variance-trade-off": "The trade-off between approximation and estimation error is usually called the bias/variance trade-off. The bias corresponding to the approximation error and the variance corrsponding to the estimation error.",
  "imbalanced-data": "The imbalanced data problem refers to the problem where the distribution from which the data is taken has an imbalance. This is not good because machine learning algorithms will try to minimize the error, and thus, predict in favor of the imbalance majority. They can often achieve really good results by doing nothing. Hence, you probably not care about predicting accuracy.",
  "feature-selection": "",
  "embedded-methods": "Embedded methods are used to learn which features best contribute to the learning of a model while it is being created. Common methods are regularization methods.",
  "regularization-methods": "Regularization methods or penalization methods introduce additional constraints which makes the model bias toward fewer constraints.",
  "feature-imputation": "It will try to fill any missing data. We could replace the missing value with a constant (e.g. the mean value), a random value or a prediction from the other values.",
  "the-widrow-hoff-algorithm": "```pythonw = [0, ..., 0]for i in range(N): # N epochs    for (x[i], y[i]) in the training set        g = w * x[i]        error = g - y[i]        w = w - learning_rate * error * x[i]return w```",
  "crowdsourcing": "A common technique for annotating data. It uses a large pool of non-expert annotators to annotate the data.",
  "deep-learning": "Deep learning is a neural network with many hidden layers. The universal approximation theorem states that one hidden layers should be enough to approximate any function, but it is often more practical to stack many hidden layers on each other.",
  "backpropagation": "Backpropagation is the trick of using the gradients of the weights of layers occuring later in the hierarchy to compute the gradient when using the chain rule.",
  "intrinsic-evaluation": "Intrinsic evaluation is the performance measured in isolation using some metric computed automatically.",
  "extrinsic-evaluation": "How does one change to the predictor affect the performance?",
  "f-score": "The F-score may refer to a clustering method or a classification method.",
  "k-means": "K-means is probably the most popular technique for clustering and the idea behind it is to find a set of K clusters such that each data point is close to its centroid (mean vector).",
  "lloyd's-algorithm": "```pythonwhile clusters don't change:    insert x_i to cluster S_k    recompute cluster centroids for each S_kreturn [S_1...S_k]```",
  "the-elbow-method": "When we use k-means for some clustering problem and want to choose the number of clusters we wish the algorithm should find, the elbow method presumes that there are some natural cluster optima. The loss function will drop quickly until we reach this optima, but increasing the numbers more will have diminishing returns. If we plot the number of clusters and the loss, we know we can apply the elbow method if the curve looks like an elbow.",
  "principle-component-analysis": "Principle component analysis (PCA)",
  "singular-value-decomposition": "Singular value decomposition (SVD)",
  "low-rank-matrix-factorization": "A more space efficient technique for implementing PCA.",
  "cold-start": "How to we handle new users and new items in colloborative filtering?",
  "word-embeddings": "We represent words for NNs using a low-dimensional representation of real numbers.",
  "word-word-co-occurrence-matrix": "We count the occurrence of words occurring together.",
  "null-hypothesis": "",
  "statistically-significant": "The result is probably not due to random luck."
}
